select Месяц as 'Месяц поступления', Год  as 'Год поступления', ЦенаПродажи as 'Цена (Р)', МетодОплаты as 'Способ оплаты' from Прайслист where МетодОплаты in ('Наличные') or ЦенаПродажи between 500 and 10000 ;
select НазваниеФирмы as 'Название', Район,Улица, Дом, Этаж, Секция from АдресАптеки where НазваниеФирмы like 'Аптека_Вита' and Район = 'Тольяттинский';

select * from Прайслист order by Год desc, Месяц desc;
select * from Прайслист order by ЦенаПродажи asc;

select count(*) as 'Количество', sum(ЦенаПродажи) as 'Сумма',МетодОплаты from Прайслист group by МетодОплаты having sum(ЦенаПродажи) > 300;

select * from Прайслист
inner join Товар on КодТовара;
select * from Прайслист
inner join Товар ON Прайслист.КодТовара = Товар.КодТовара;
select * from Прайслист
left join Товар ON Прайслист.КодТовара = Товар.КодТовара;
select * from Прайслист
right join Товар ON Прайслист.КодТовара = Товар.КодТовара;
select * from Прайслист
full outer join Товар ON Прайслист.КодТовара = Товар.КодТовара;

select * from Прайслист
right join Товар ON Прайслист.КодТовара = Товар.КодТовара
case
	when	ЦенаПродажи is NULL
	THEN	'Отсутствует'
	ELSE	CAST(ЦенаПродажи AS CHAR(8)) 
	END 	ЦенаПродажи

	
select МетодОплаты, НазваниеТовара = case МетодОплаты
	when 'Бесконтактная'
	THEN 'Оплата не приминается'
	else МетодОплаты
	END 	
from Прайслист
left join Товар ON Прайслист.КодТовара = Товар.КодТовара;

select 
	НазваниеТовара, ЦенаПродажи = case 
	when	ЦенаПродажи < 300
	THEN	'Уточните в отделениии'
	ELSE	CAST(ЦенаПродажи AS CHAR(8)) 
	END
from Прайслист
left join Товар ON Прайслист.КодТовара = Товар.КодТовара;



select ТелефонАптеки,(
	select Фамилия from ДиректорФИО where Аптека.КодДиректора = ДиректорФИО.КодДиректора
) as 'Директор' from Аптека;

select ТелефонАптеки from Аптека where Аптека.КодДиректора in (
	select КодДиректора from ДиректорФИО where Фамилия like '%ко'
)

select Район, ТелефонАптеки from 
(
	select Район,ТелефонАптеки from Аптека
	left join АдресАптеки on Аптека.КодАдреса = АдресАптеки.КодАдреса
) subq where Район like 'тольятти%'